/* ゲームパッド添字
L2　　　　　　　　R2
L1　　　　　　　　R1
---------------------
　Ｕ　　　　　　Ｙ
Ｌ　Ｒ　ＰＭ　Ｘ　Ｂ
　Ｄ　　　　　　Ａ
　　　Ｈ　　Ｉ
---------------------
　　　　 Ｚ
*/
function getGamePadMapping() {
    return {
        'A': 0,      // South
        'B': 1,      // West
        'X': 2,      // East
        'Y': 3,      // North
        'L1': 4,     // L1
        'L2': 5,     // L2
        'R1': 6,     // R1
        'R2': 7,     // R2
        'SELECT': 8, // SELECT (POSE)
        'START': 9,  // START (MENU)
        'H': 10,     // 左棒押込
        'I': 11,     // 右棒押込
        'UP': 12,    // ↑
        'DOWN': 13,  // ↓
        'LEFT': 14,  // ←
        'RIGHT': 15, // →
        'Z': 16,     // 背面ボタン？
        'Stick': {   // スティック
            'L': {   // 左棒 -1.0〜0.0〜+1.0
                'H': 0, // L:-, R:+
                'V': 1, // U:-, D:+
            },
            'R': {   // 右棒 -1.0〜0.0〜+1.0
                'H': 0, // L:-, R:+
                'V': 1, // U:-, D:+
            }
        }
    };
}
