/* ゲームパッド添字
Ｇ　　　　　　　　Ｋ
Ｆ　　　　　　　　Ｊ
---------------------
　Ｕ　　　　　　Ｎ
Ｌ　Ｒ　ＰＭ　Ｅ　Ｗ
　Ｄ　　　　　　Ｓ
　　　Ｈ　　Ｉ
*/
function getGamePadMapping() {
    return {
        'S': 0,  // A (South)
        'W': 1,  // B (West)
        'E': 2,  // X (East)
        'N': 3,  // Y (North)
        'F': 4,  // L1
        'G': 5,  // L2
        'J': 6,  // R1
        'K': 7,  // R2
        'P': 8,  // SELECT (POSE)
        'M': 9,  // START (MENU)
        'H': 10, // 左棒押込
        'I': 11, // 右棒押込
        'U': 12, // ↑
        'D': 13, // ↓
        'L': 14, // ←
        'R': 15, // →
        'X': {   // 左棒 -1.0〜0.0〜+1.0
            'H': 0, // L:-, R:+
            'V': 1, // U:-, D:+
        },
        'Y': {   // 右棒 -1.0〜0.0〜+1.0
            'H': 0, // L:-, R:+
            'V': 1, // U:-, D:+
        },
    };
}
